{"posts": [{"title": "My confession to my crush", "url": "https://www.reddit.com/r/loveconfession/comments/cy2y8e/my_confession_to_my_crush/", "selftext": "Ok so this actually started not that long ago. Me and one of my old time friends from primary randomly started texting each other (I believe it started when I looked through Instagram and tried searching some names I remembered and there she was). Now In primary school we pretty much had no connection apart from a maths club during school(A time where 4 students where picked and during a Wednesday would go into a room with a teacher and do some extra maths). That was the most time we spent together and still we didn’t really like each other in the way we do now(Well she’s been hinting at something I hope I’m not getting the wrong hints) Anyways we started texting and all that you know the back tracking school memories and stuff. Then out of no where I just feel this hush of happiness coming from her and I feel like we really connect. After a while of talking I start to get anonymous messages on Tellonym(A site where people can send anonymous messages) and I saw that someone liked me. Eventually they started giving me clues as to who they were and I realised it all adds up and that it was now obvious that she indeed liked me now that I think about it this is more about how she confessed her love for me but I’m just going to say it I confessed with a scrambled sentence \nl eoyo tuiiok meaning I like you too \nBut she hasn’t unscrambled it yet so hopefully she likes my response"}, {"title": "I truly have found my soul mate and it’s unlike anything in the world", "url": "https://www.reddit.com/r/loveconfession/comments/c31rwy/i_truly_have_found_my_soul_mate_and_its_unlike/", "selftext": "I’ve been dating the love of my life for about 10 months now and I would be a liar if I didn’t say how dull my life was before I met her. The same reason we started dating is easily reminded when we are together and even we started dating we figured out very quickly how compatible we were, it was a connection so pure that we almost didn’t even have to say anything we just knew how badly we wanted to be invested in each other’s lives, Friends and family alike always commented on how much we remind each other of each other. We are the same in the best way but even more perfect opposites. What brought me to write this post is because how much she really has been there for me when I’ve needed her the most even when she shouldn’t be, we have fought we have argued but at the end of the day we find our way back to each other no matter what, we literally make fun of why the other was mad (in a healthy way) to realize that what upset the other was just dumb. We know how to grow from mistakes and how set boundaries that will limit our mistakes but what makes our relationship last is that we both are human and can admit our flaws and be completely vulnerable, with out conditions, we truly love and accept each other for those exact reasons.  The simple days are never taken for granted and our most thought out ideas are always commonly appreciated. I’m 25 and have been in a few relationships and to say they pale in comparison would be a vast understatement and quite frankly an insult to how perfect she really is. I can truly say with confidence that I want to spend the rest of my life with this girl. Thank you for being my best friend Brooke! Cheers to the now and many more wonderful memory’s ❤️❤️"}, {"title": "How I confessed to my bf", "url": "https://www.reddit.com/r/loveconfession/comments/bydgo3/how_i_confessed_to_my_bf/", "selftext": "I was leaving school on a Friday (school was still happening) when I get the feeling to confess to a boy I like. I decided to talk to my friends (who are all girls) about this. They didn’t want me to text him, but I did anyway.\n\nI texted him, confessing my feelings, but I said it in Japanese. (Thx Google Translate!!) He couldn’t understand so I finally said it.\n\nMe: “I...I LIKE YOU!!” You probably think it’s weird that an ugly brat like me likes you, but I do!!”\n\nAnd OOOH BOI does the plot thicken.\n\nThe boy, who I will nickname NC (Nice Crush) replies:\n“Omg I like you too!”\n\nI was S H O C K E D\n\nI was SOO happy! But I didn’t want to scream. I was so happy that my crush liked me back!!\n\nWe have been BF and GF (yes I am a girl) from March to right now! ^^"}, {"title": "we were so young", "url": "https://www.reddit.com/r/loveconfession/comments/b5jzbg/we_were_so_young/", "selftext": "“I feel like I’m falling in love with you and that’s scary at 16.” - my now longtime boyfriend before he and I were even dating. "}, {"title": "Modest Society", "url": "https://www.reddit.com/r/loveconfession/comments/9w40fw/modest_society/", "selftext": "I love this girl that lives upstairs in my Grandma's, but i only visit the place like 3 times a year. I don't know if she's not interested in me or if she's trying to be modest, i really can't say the difference.. She has changed me forever, in every aspect. I'm a better person inside and out because of her, i tried before, i failed because i had nothing to motivate me. I was a asocial numb before, now i have built up my confidence overtime. Since the day I saw her I've been improving myself because I feel like I'm \"out of her league\" and asking her out now would only end up in rejection. Which I won't be able to handle. I've lost so many things in life because I didn't man up and talk, due to my anxiety. I don't know if I'll ever get with her, but i really hope i do. Its been 2 years already, no progress with her whatsoever. Also I'm from a modest background and she never goes out alone and I never had any chance to meet her. Maybe I'm coming up with reasons for failing to talk to her. I don't know at this point.. She showed clear signs at the beginning but these days not so much. It really fucking hurts, I wish things didn't work this way.\n\nMaybe my environment is not letting me to act upon what i want, but my assumption is that you don't. Always work on yourself and be a better person every time you wake up. Drive motivation from your dreams.\n\nSorry for bad English. I cannot talk about this with anyone around me, so just putting this out helps me so much, you wont understand. Thank you and good luck!\n\n20/09/2019 Haven't seen her since I posted this, I should've gone for it. My fear of rejection fucked me over, I thought I had time and I was wrong. She is in my mind every minute, it hurts. I still love her and from now on I'll take any opportunity to talk to her.\n\n27/10/2019 I managed to find a number and it turned out to be her sister, then eventually I was texting with her. Not a hour in, I told her that I loved her on 06/10/2019. She's busy with her life so we only texted each other twice a day and a call here and then. I was happy and motivated as I've ever been. Last 2 days I haven't received any reply and I don't know what's happening. I think her mother got to know and things didn't go too well, this is me guessing. I have no idea what happened. Today I was blocked on social media, that's the only way I could keep in touch. The day she said that she loved me was the first night in my whole life where I slept with a free mind, I felt so withered away from all the problems. I guess I have to wait again as I did before untill I meet her and find out what's the problem. This waiting game isn't fun, it beats me every night and day. Happy things don't last for too long don't they."}, {"title": "My Story", "url": "https://www.reddit.com/r/loveconfession/comments/7vxcj1/my_story/", "selftext": "There was a girl that I liked before, and I have tried to give her obvious signs. She didn’t seem to get any of my signs. Suddenly, when we were chitchatting while eating, somehow it reached to some topic, and she told me that she’s close with someone right now. Then I got struck. Well, I look kinda desperate after. We got back.\n\nI actually am confused as to what to do at that time. I looked onto Reddit for advice, and decided to confess after seeing a comment which says you’ve got to take your chances.\n\nSince I figured that I may have nothing to lose, I confessed. She said she didn’t have any clue and was shocked. Then, levelheadedly she said that we shall see.\n\nNot long after, they started to date."}]}