{"posts": [{"title": "It was only just a DREAM", "url": "https://www.reddit.com/r/loveconfession/comments/huzh7g/it_was_only_just_a_dream/", "selftext": "Fleeting moments\n\nThose fleeting moments of connection with you... I wish they lasted forever. They seem so long ago, but I felt so close to you.\n\nI hung on to every word when you opened up to me. The more you opened up, the more drawn to you I felt.\n\nDo you ever look back on these memories?\n\nYou're on my mind all the time. The hardest thing right now is not knowing when or if we will ever connect like that again. Everything makes me think of you and it sucks to feel distant from you. I hope that we find that again."}, {"title": "What to Do or Not to Do?", "url": "https://www.reddit.com/r/loveconfession/comments/ht70i5/what_to_do_or_not_to_do/", "selftext": "Long story short .. I have the coolest and most amazing best friend I could ever ask for . She’s my ride or die for life .  Issue is I fell for her . You know you love someone when that’s the only person i care to be around . I used to be out and about, never home , and always with people. She’s more of a loner , independent. Her life story is nuts . All I want is her to be happy . I feel that it’s hard for me to make her happy. Mainly because we like doing different things besides getting high together. My first mistake was telling her how I felt . Which I did before our friendship bloomed from friends to best friends. She told me she’s not mentally ready to date anyone besides her long time ex who literally destroyed her . I tried moving on and fell for a woman who I thought i could marry . But the more that went on the more I missed my best friend. My heart aches . I want to me her man .  We do everything together now except have sex .. honestly that’s all that’s missing for me . It sucks because I don’t want to sleep with anyone else. Trust me I’m a man whore , so you can understand how hard it is.. she has opened my eyes to so much in life ,.. without her idk how deep of a rabbit hole I’d be in. I hate feeling this way . This is not me .. it comes across as an obsession but I can’t help where my heart and mind always is ... I’m doing everything I can to just be that great guy friend.. but I can definitely tell since I opened up about my love for her , I feel she’s pushing me away just a tad ... I hope I’m over reacting, for my sanity sake but I never felt this for a friend before.. maybe this is my karma for all my female friends I’ve hurt who wanted to me with me , but I was too shallow and couldn’t be honest... well how to I get over this feeling , because I absolutely can not loose her in my life ? I’d do anything for her and she would for me too ... I just have to get over it eventually. I tried lying to myself but I don’t want any pity . Especially from her and she knows that we can tell each other anything. There’s my love confession!"}, {"title": "Right person wrong time", "url": "https://www.reddit.com/r/loveconfession/comments/hpydpf/right_person_wrong_time/", "selftext": "I'm still in love with a guy I dated when I was very young. It was the first of the only two long term relationships I've been In. We lived in a small town in FL and met in middle school. Then my mother moved us to NJ and he came to live with us soon after.\n\nI had a dream about him last night. So I woke up very upset.\n\nI do not regret breaking it off back then. I just wish we would have known each other as adults. After we had matured past pettiness. It's been around 6 years since I've seen him.\n\nHe is in a long term relationship now so I can't say anything directly to him but Zack U. I still love you man."}, {"title": "Why I’m depressed", "url": "https://www.reddit.com/r/loveconfession/comments/hpfpx3/why_im_depressed/", "selftext": "I hate my life at the moment. I wish I could go back in time. I wish I never met her. Okay Imma tell u the story on why I’m depressed and no one knows it. So coming to girls I never was good with them, it was always ohh I’m Sorry but ur so sweet but I’m Sorry I’m not interested.\nBut those where just crushes. I never had love as u can say till 2 months ago. One thing to note about me I’m kinda inpatient with these stuff. Continuing 2 months ago I kinda had a crush on this girl but she didn’t and I get it. But what came after is hell through her I met a lot of new ppl but one stounds out more clearly then anyone let’s call her (c), I met (c) in a group chat she wrote a lil uzi very lyric and then I continued it went over and over till the song finished from then Ik something would go wrong but ofc I still went with it. After that we talked a lot. She is amazing those grey and blue eyes, those freckles on her cheeks and on her nose , those lips she is really beautiful and pretty. But most importantly her personality was the kicker she loved the same stuff I loved , the same music, the same favorite food and color and multiple others. That’s when I fell in love with my first love. She was on my mind 247 she was the only thing i used to think about. Soo I Decided to ask. Why did I ask. Why then. She said no. She best friended me. After that the light through my life at the moment turned off. She was the thing for me to get excited for tomorrow after that I felt empty like I didn’t feel anything basically like a robot after that I broke down. I cried for hours and no one knows . I hate how my first love didn’t even happen so yea that’s the story know I’m depressed with out any one knowing I put a mask on when I’m out with ppl. Why can’t I get love. Why can’t I get a girl that loves me as much as I would love her. Is that to much to ask for."}, {"title": "Still in love with my first gf", "url": "https://www.reddit.com/r/loveconfession/comments/hglkc2/still_in_love_with_my_first_gf/", "selftext": "So I'm still in love with my very first gf and we broke up in 2014. She was the one I was going to marry and spend my life with but our paths went different ways. We are still friends and had a civil breakup but I can't get over her but she also lives states away now. I am dating another girl and my current gf is an amazing girl but I feel like I may not truly be in love with her and it makes things hard sometimes because I think about my ex alot..."}, {"title": "I still like you but I have to let go", "url": "https://www.reddit.com/r/loveconfession/comments/hcx604/i_still_like_you_but_i_have_to_let_go/", "selftext": "I don’t know if you have ever felt this way. You like a person very much, but you know that there is a high chance that you won’t be together in a long-term. This kind of love is so strong yet so sober and so conscious. The nature of it intimidates me and forces me to stop contacting him. I restrain myself extremely and suppress my emotions until I let go of him completely. Do I like him? Yes. I’m happy when I receive his message. I look forward to the next chat. I imagine us being together. But the fear is always there to tell me that I should stop talking to him, even if I still care for him and deeply like him. \n\nTo you,\n\nI liked you. I guess I still have feelings for you now. I was afraid that we wouldn’t work out so I never told you that I liked you. I just masked myself all day pretending I didn’t like you. I don’t know why you were upset with me at the beginning of the year but I’m sorry if I ever made you feel bad. I feel you tend to avoid me recently…I don’t want to bother you and I don’t want to be sad by being ignored, so I stopped initiating texts. I decided to let you go even if I still care for you.\nThank you for having been there for me when I was upset. I appreciate your support and help you ever offered. I love you no matter what. I hope you are happy!"}, {"title": "One sided love.", "url": "https://www.reddit.com/r/loveconfession/comments/h8w0i9/one_sided_love/", "selftext": "Something you should know before.\n-I've never been in a relationship\n-Never held a guys hand or went further than that.\n-And the men in my family havnt been supportive or there for me.\n\nSo there's this guy I met at uni. Can't say he's super good looking or anything but he has a good personality.\n\nWe talked about some deep shit (like self harm and depression) and our struggles in life through messenger. He was the first one to bring out the topic and he felt so genuine. After that he kept checking up on me. And before I even knew it we were chatting daily and we got super close super fast. Like hes just so easy to get close to.\n\nLater found out from chatting that its because his friend committed suicide. So now he has a habit of checking up on people because he doesn't want to make the same mistake.\nThe thing is. I'm falling for him. I think I'm emotionally attached to him. Sometimes I really want to hug him, kiss him, be there for him. I really like him.\n\nBut he has a girlfriend. And he's pretty respectfull of her. I get sad but I understand.\nI don't know if it's the loneliness or lack of intimacy. But I really like him and only him and I can't seem to stop thinking of him and getting excited when my phone buzzes of his message. \n\nWhat do I do. I'm really sad :((\nHelp out a super lonely, emotionally unstable, never been in a relationship girl.\nThanks."}, {"title": "My first love I think", "url": "https://www.reddit.com/r/loveconfession/comments/gzting/my_first_love_i_think/", "selftext": "I met this girl she is amazing she has an amazing personality she likes the same shit I’m into and all she is really pretty she has amazing eyes and all and I can’t get her out of my mind and the problem is that I think she isn’t into me. She keeps on finding excuses but when I asked her to hang out she said yesss but idk I’m really scared to have my first love to go to shit I never dated anyone and I think she is my first love when I think of her rejecting me makes me tear up help me please idk what to do."}, {"title": "I did it", "url": "https://www.reddit.com/r/loveconfession/comments/gz37sj/i_did_it/", "selftext": "So I asked my crush out basically. I texted her and said( hey wanna hangout after this quarantine shit ? We could watch a movie or something) she didn’t respond she’s busy ig I’m so scared this one is special\nI will update u guys when i get a response. Wish me luck!."}, {"title": "I lie to see him laugh", "url": "https://www.reddit.com/r/loveconfession/comments/gytabz/i_lie_to_see_him_laugh/", "selftext": "I’ve been dating the most amazing guy for a year now. But I’ve been lying to him. He loves to tickle me, all the time. I freak out and jump around when he does. I love seeing his face light up and his big smile. But the truth is, I’m not ticklish. At all. I never have been. But every time he tickles me I fake it just to see him laugh like a little kid. I hope he never finds out I’m not ticklish, I never want to miss that smile and laugh."}, {"title": "I’m confused", "url": "https://www.reddit.com/r/loveconfession/comments/gwz5f9/im_confused/", "selftext": "So I just met this girl from like 3 days ago and she is the first person I have ever met that’s like me we have the exact same opinions her favorite food is pizza so as mines her perfect date is to play video games and eat and chill, the point is we share a lot in common and she is really pretty she has amazing green eyes, and for some reason I can’t get her out of my mind and when ever I think about her my hart starts racing tell me am I falling I need to know"}, {"title": "And suddenly all the loves songs started making sense", "url": "https://www.reddit.com/r/loveconfession/comments/gcthug/and_suddenly_all_the_loves_songs_started_making/", "selftext": "I heard it somewhere and this hit me so hard cause whenever i listen to any romantic song all i can think is of her only her"}, {"title": "I like someone who's dating someone else...", "url": "https://www.reddit.com/r/loveconfession/comments/gans05/i_like_someone_whos_dating_someone_else/", "selftext": "So, i need help. I have a friend, a great one at that. She has helped me trough so much and i think im falling for her. The thing is, she has a girlfriend.\n\nI dont really know if im an a-hole for liking her while shes dating someone, but at the same time love comes naturally.\n\nIf you beautiful people of reddit can help me overcome this obstacle it will mean a lot to me.\n\n~~btwimalsofemale,pansexual.sheslesbian~~"}, {"title": "I think I'm falling for him already", "url": "https://www.reddit.com/r/loveconfession/comments/g60o3f/i_think_im_falling_for_him_already/", "selftext": "Hi Reddit,\n\nFeels like I didn't have anyone to get this off my chest. I'm not usually the type of person who posts online but I guess I'm doing it right now, and not quite sure as well if this is the right place I should share this in Reddit. Alright, here goes nothing.\n\nI'm just your typical guy, I just turned a quarter century last March, didn't quite enjoy it much due to the lockdown. Anyway, a guy at work messaged me through facebook messenger but at that time, I wasn't really active on using it. That was on September last year and a month after, I decided to come back to messenger and I saw his message. I thought to myself I've seen this guy before on our floor (we work on the same production floor). There were times we bumped into each other in the hallway, at the stairs, waiting for each to say \"hi\", but didn't happen. A friend of mine, whom he's friends with too, came up to me at my workstation and gave donuts, told me it was from this \"guy\" who likes me. I was like \"okay?\". I decided to send an email to him, thanking him, he immediately replied, and that was the beginning of, I could say, what I'm feeling right now. \n\nWe have been talking through chats at work, like probably almost every single day, then all of a sudden he asked me out since at that time it was almost the holidays. He asked to just hang out with him, grab some coffee and have a chit-chat. It went well, it was kinda awkward but it wasn't really a special night, but he enjoyed it. We exchanged numbers, introduce ourselves and whatnot. We came back to our daily routine at work where we chat every single minute at work. At work, at home, anywhere, we try to keep ourselves busy by messaging each other, talking about whatever topic we come up. He asked me out again, this time seeing a movie. It was great. Both of us haven't said anything yet about who likes who, it's just, probably the way it is, like go with the flow. \n\nI think I'm beginning to like this guy even more. I've dated girls before, but I haven't had a thing with guys. I guess I haven't just found out that I could feel this way too. I feel scared if I should tell that I like him, or wait for him to say that he likes me, or we can just wait for the moment where it brings us to the right time to confess our feelings for each other. I literally don't wanna rush and ruin the moment. I want to know him better first but it feels like I already freaking like this guy. Already telling him every single day that if he feels the need to talk to anyone, I'm always here for him. He tells me the same, he cares a lot about me too.\n\nRight now, I'm at home, and he is about to volunteer to work at the office. I've been trying to tell him to take extra care outside, he's going to be staying at the hotel for two weeks. Somehow, I get this feeling of anxiety of what's going to happen to him, few years from now do we still get to talk? Is there going to be a moment where we will be confessing each other? I guess I'm already scared to lose him, but, why? \n\nApologies for the wall of text, wrong grammar and such."}, {"title": "Im in whole and I need help", "url": "https://www.reddit.com/r/loveconfession/comments/g3jw1i/im_in_whole_and_i_need_help/", "selftext": "So this start on September when I see her, she immediately atract me so in october in a school trip I talk to her (that was hard for me cause Im shy) so we laugh in all the school trip and I asked her for her number, at the next day we text for 2 hours and a half and then I fall in love with her she was so cute with me and funny, we are both shy and we like similar thing and I feel a connection, starting that day we began to talk always, in Valentines day I decided to make her a little gift and confess my love to her, so I give her the gift and she like it so I let the school and my friends say that she say no, that day I feel so sad and depressive I feel like all my time was wasted, so I see her in a party of a friend and then I realize that I can't live without her, after the party I was in my house and she text me and she say me that she felt so bad about that and she say me that she want time to think about it so I give her the time and my friends (that are his friends too) that she was going to say me on a tuesday but quarantine and I haven't see her a month or something and I feel so stressed about that.\n\n\nMaybe after you read this you feel like is a horrible story but is my story and there is a lot of things that I not tell.\n\nP.d The tittle is wrong"}, {"title": "This is how life is. Sometimes we love people that don't love us back the same way. Read the story and don't make life harsh on you.", "url": "https://www.reddit.com/r/loveconfession/comments/g0lboz/this_is_how_life_is_sometimes_we_love_people_that/", "selftext": "Throwaway account because of reasons. I'm actually writing this only to get it of my chest and also, if there is someone that reads this and finds this useful it will sure make me glad.\n\nObviously, every story has a nice beginning and a worse ending.\n\nI've met this girl two years ago. She is from the same neighborhood, but I've never met her or seen her before. Since we met, we started hanging out alot. Like everyday, talking on the phone, messaging and everything else. This girl came into my life when I needed someone like that as never before. But at that time it was only friendship, she had never seen me more than a friend and it was the same case from my side, I never saw her more than a friend.  So, as we proceeded to hang out with the same group of friends, there were always that few people that just \"pass by\" now and then and hang out with us. This one time, came one guy, that was my good friend and we all started hanging out. She started liking that guy and started talking to me about him. I was that one good guy that told her directly how this guy was, while also trying to make her like him, because of bro code. They were going on and off for some time and she was all nervous and sad because he started treating her with less enthusiasm since they met and she thought that was the end of that... He started ignoring her, he was being very unreasonable and she kinda let it go, but she still had feeling for him. Naturally, as we were hanging out, we were at her place, talking, watching TV and genuinely having fun. She asked me to stay over, obviously I said sure, no problem and I stayed over. I don't know how and why, but we fell asleep on this couch where we hung out for last few hours... At one point of the night I woke up and somehow we were really close face to face even though we decided to sleep the opposite ways because of the \"friend code\". So I open my eyes and I see her face, I'm kinda shocked like how did this happen. I think nothing of this and I decided to move away a little bit, you know, to not make it akward and fall asleep again. Next time I wake up I'm facing the other side but I decided to switch the side because I couldn't sleep on my left side anymore, I turn around and she is facing the other side. This was really nice, I was so comfy and didn't care anymore, but couldn't fall asleep anymore. I close my eyes and try to sleep and I fell her turning around, I open my eyes and see her staring straight into my eyes. The problem occurs here, I don't how and why this happened, but we had our little moment for the rest of the night... We actually never went back to sleep after that. And because this was happening while she was being ignored by that other guy she felt really bad after that. We talked and I said, Ok it happened, It happened for a reason, but I don't want to lose you as a friend, I can forget it no problem. But she couldn't let it go, she is very fragile and a very emotional person and she had never had a real boyfriend before that. So, she couldn't let it go, she finally got the chance with the guy and she was very happy with him for a long time, but that broke away soon and she told me by one occasion that I was totally right about that guy and that she was sorry about everything that happened because we were very tight. After that guy, she met another guy and It was more than 2 years combined in both relationships. Soon after, the second guy broke up with her and somehow I managed to get back in contact with her because of a friend. We started going out, I was and still am trying to make her feel full of life, make her happy and well it is going well. But something is very different, I have never seen her being more than a friend to me, even back then, 2 years ago, and that is the same way I approached her this time. But something is very very different, something is very very odd. I NEED to see HER everyday. I NEED to talk to HER everyday because the same way I'm helping here get back on her feet, she has the same effect on me. And the problem is I started catching feelings for her even tho I'm not supposed to. So here I am, typing this post just to get off my chest. And I hope atleast someone is reading, because I can't stress enough, that we need to learn to let some things be their way. I guess I will always only be her friend, because I would rather be in love knowing I can't have her, than not having her at all. LEARN TO LET THINGS AND PEOPLE GO FOR YOUR SAKE... LIFE IS LONG, YOU ARE PROBABLY YOUNG... HAVE FUN, MEET PEOPLE and if you really know the state of your relationship with someone COMMUNICATION IS ALWAYS THE KEY. SPEAK TO THE PERSON ABOUT EVERYTHING THAT IS BUGGING YOU...\n\nRelevant stuff: We are between ages 21-25. We are finally hanging out after 2 years of separation. I'm shit at English and I guess i will never log back in into this account.\n\n&#x200B;\n\nI hope someone find this story useful for them.\n\n&#x200B;\n\nLove ya all <3"}, {"title": "The Flower From Nowhere (A loveletter)", "url": "https://www.reddit.com/r/loveconfession/comments/fnxpzl/the_flower_from_nowhere_a_loveletter/", "selftext": " Thank you Lena, for allowing me to dream once more. \n\nI never thought that I would be able to be this close to ecstasy again, after living a hellish life for so long. I wasn’t able to spend much time with you, was I? I regret taking everything slowly now. I know you don’t love me like I do you. But even then, was it ever really the romantic kind of love?‌ I just knew that you were someone that I wouldn’t mind spending the rest of my days in the apocalypse with. \n\nYou are the most mystical, storybook-like girl I’ve ever known, and you come from a kind, if misguided, family. You yearn for something greater than here; something that your family, this small city, and I could probably never grant you. But I so did want to. I never cared if I never found love with you. I only wanted you to be happy, whether that was with me or with someone else. And it was preferably someone else, because I knew deep down that I could never satisfy you. \n\nI don’t think we’re perfect fits either. But as I came to learn in the last few days, love is not all about compatibility. It’s a lot more about the shared, intimate experience. That’s why love can come from the strangest places, between people on polar extremes. It’s the shared struggle and pain, the shared kindness and comfort, that deepens a bond. This goes beyond romance, and extends to friendships and family bonds. \n\nI love you Lena. I won’t deny that I wished you could say the same. But this isn’t a storybook with a happy ending, at least for us. But that doesn’t mean there can’t be a happy ending in this storybook of us at all. Have I said that I love you? And I hope to see you smile again. That damned smile, haha.\n\nGoodbye Lena. I loved you."}, {"title": "B.S - First Real Crush", "url": "https://www.reddit.com/r/loveconfession/comments/fmifpi/bs_first_real_crush/", "selftext": "B.S - First Real Crush\n\nIt was back in Grade school, you and me was always together, you were the fastest girl in the school, I was the most athletic in the school.\nYou and me had that connection but maybe it was just a kids thing.\nI never got the chance to say I liked you because I had a crush with another girl.\n\n7 years later I dreamt about sitting in the couch with my family, you suddenly walking through a light and going towards me, then sitting beside me.\nWhen my family went to sleep it was just you and me. \n\nYou learned against me and I put my hands around you.\nIt wasnt anything sexual or anything, but it was intimate and it was all I needed to feel loved.\n\nThe last time I seen you was in my work a year ago, I served you with your friend, it was 10am.\nYou tried to acknowledge me by giggling, I tried to pretend I didnt know you.\nMaybe because I didnt have a proper job, maybe because I wasnt in the mood.\nBut I wished I could've talked to you.\nGod even gave me the opportunity to talk to you again a day later when I seen you walking in the street. I never took.\nthat chance because I was in my work uniform.\n\nI'm sorry for the excuses, I really wanted to know more about you, I've got a few questions to ask you.\n\nHow are you? \nWhat have you been up too?\nYou got a Boyfriend? \nYou look for anyone right now? Cuz maybe I can be the one for you."}, {"title": "I like my friend, how do I approach this?", "url": "https://www.reddit.com/r/loveconfession/comments/fm0uba/i_like_my_friend_how_do_i_approach_this/", "selftext": "Basically the title, I had developed a crush on her in senior year of high school, it went away, but the feelings came back stronger. I told her how I felt, she wasn’t ready, and we got over it. Later in college I was texting and chatting with her, when these feelings came back even stronger.\n\nHow do I tell her that these feelings are still here?"}, {"title": "Suddenly started dreaming about my ex wife and missing her after being divorced for over a year", "url": "https://www.reddit.com/r/loveconfession/comments/fdmr0u/suddenly_started_dreaming_about_my_ex_wife_and/", "selftext": ""}, {"title": "Confusing work situation", "url": "https://www.reddit.com/r/loveconfession/comments/f77v7v/confusing_work_situation/", "selftext": "I work at a publix as a closing produce clerk so I don't have a lot of people to actually talk to since only one person closes produce usually. In my life right now I'm not even looking for a relationship but I met this girl who works in the bakery and shes just absolutely amazing. She just makes work fun when we close together and we have pretty good chemistry together. I think I make her work fun as well as she seeks me out from time to time, just to tell me shes bored so I usually try to make her laugh.  The confusing part is what I said earlier, I'm not really looking for anything. But even though I'm not even looking for anything she still broke through and made me catch feelings. My question is this, would it be better for me to keep her as a friend or should I give it a try and see how it goes? Any advice is welcomed"}, {"title": "I'm in a pickle", "url": "https://www.reddit.com/r/loveconfession/comments/f66bxp/im_in_a_pickle/", "selftext": "I met this girl three years ago in my advisory class. We started talking well I at least thought so and I caught feelings. I didn't know how to tell her. So I went out and just told her. She didn't talk to me for a week after. After that year we were buds I mean we talked when we bumped into each other at school and now three years later I'm starting to catch feelings again idk I think she is super sweet and nice. I like her for who she is. Idk how to tell her of if I should tell her. Any advice"}, {"title": "Embarrassed to write this", "url": "https://www.reddit.com/r/loveconfession/comments/f652p8/embarrassed_to_write_this/", "selftext": "Joined reddit today to write this. Some say writing down what you want is the best way to make it a reality. I don't know about that, but it doesnt hurt to try. \n\n      You are from a well to do family. A family I greatly respect and ,at times, feel a part of. When my mom and I first moved to this city with nothing after the divorce, your family gave us 5k$ to get back on our feet. When my mom would leave for work your mom would give me a ride to elementary school, and you were always in the car.  \n\nThrough middle, highschool and college we were basically siblings, never anything else. Honestly, I only saw you as a  naive, spoiled, pretty, rich girl that was born with a silver spoon in her mouth. \n\nBut now, being almost 30 yo, and having gone through multiple relationships and experiencing many different women, I finally see how beautiful of a person you've turned into, inside and out. Despite your family's wealth you live the most frugal lifestyle, and yet being generous to those lacking. You choose to work behind the scenes rather than being the center of attention. You always make others feel important paying attention to those who feel left out in the group. \n\nAt times you show me pictures of pretty models, asking if i find them attractive. And you always complain that my standards are too high when I answer \"no\". \nI really don't. I don't know why and how, but you are the only person that I find trully attractive.\n\nIt's such a burden keeping this a secret. I know it's impossible for me to be with you. The difference in the socioeconomic class is just too great. But ill try my best. I will do everything in my power to be good enough for your family. Maybe, when we are together, we can read this and laugh at how cringey it is."}, {"title": "I’m in a weird spot", "url": "https://www.reddit.com/r/loveconfession/comments/eykurl/im_in_a_weird_spot/", "selftext": "I met this foreign exchange student from Germany (let’s call her L) . I loved her immediately. I spent as much time with her as possible before she had to leave. I think she loved me. I’m not sure. But there were a lot of moments where I think we fell for each other. She left after about two months. We talked for a while after that but then we stopped talking (I don’t know why). That was about 4 and a half years ago. I always think about her but I don’t think I’ll see her again. I haven’t had a crush on a girl since her. But I really want to be in a relationship. I’m starting to lose my mind. I’ve also spent a great deal of that time alone in my own head as well. I keep looking for someone and I don’t know if I have a crush on a couple girls I know. It’s like I don’t know what it feels like. I just want to wake up with someone I love like or more than L. Sometimes I think I won’t. Sometimes I think L is the best I’ll do or find. Maybe someone will come round soon I think I felt something, like a sign of sorts. I don’t want to lose hope but it’s hard. It’s hard"}, {"title": "My Mistake", "url": "https://www.reddit.com/r/loveconfession/comments/eu35ch/my_mistake/", "selftext": "It's a lot to read. No tldr because it loses meaning. Excuse my English because I'm on mobile.\n\nI realized this watching the YT video below. I'd recommend you watch it before reading my post.\n\nhttps://youtu.be/nZr-nD-z2So\n\nShortly before me(m20) and my ex(f20) had our 3 year anniversary since our first date, I broke up with her. I was simply in bed, unable to go to sleep, when I got hit by this \"epiphany\" that everything would be better for both of us if we broke up. \n\nI texted her telling her I wanted to see her soon because I didn't want to break up via text, but she insisted that if I had something to say I may as well text it to her cause we didn't know when we'd see each other again.\n\nI talked to her about how I felt, how the relationship just didn't feel the same way and that it's be better if we both just went out own ways, and we broke up. I felt happy at first, because even though we were both sad I just had it in my head that she would be happier with someone else. For the last year we had been having multiple fights, and I could tell she wasn't as happy as she had been the first two years. \n\nHowever, everyday since then (three-four weeks ago), I haven't been able to stop thinking about her. I don't cry nonstop anymore like the first couple of days, but I still think about her all the time. When I wake up, go to work, go to the gym, hanging out with friends, all the time. I could only guess she's also thinking about me as much, but only because we had been dating for so long and the way the breakup happened was just so quick and out of nowhere.\n\nI was on YT just now, and it said \"The Hardest Person in the World to Break Up With\". So I watched it, and realized the person it was talking about was me. I was the first kind of person. \n\nI don't know if it counts as cheating, but I was starting to look at other women as potential girlfriends. I felt horrible, but I didn't have the heart to tell my girlfriend that because I know how upset/sad it would've made her. I know she'd never dream of being with another man, so I felt immense guilt at being attracted to other women.\n\nI also started being apathetic towards her. I didn't go visit her as often. I didn't buy her small gifts which I didn't mind buying before (and I made more money than when we started dating). It wasn't even about the money, I didn't write her long love letters every now and then. I didn't go see her at work as often. I didn't try holding her hand or being cuddly when we were together.\n\nShe always confronted me about being apathetic, and I always said I'd change, but I only did for a bit and then go back to being apathetic and so the cycle went on. I was shitty to her the past couple months, and I knew she deserved better. \n\nI wish I could just talk to her and treat her right as I once did. I would stay up till 2am talking as we once did. I'd go see her at work whenever I could. I'd do small acts that show how much I love her.\n\nBut I just don't know if she'll want to even see my face again. Whether she'll want me knocking on her door, and see the guy who caused her so much pain. I want to be able to make her happy again, but I'm too afraid of being wrong and being rejected.\n\nHowever, I also know that I probably don't deserve her, and maybe I'm just saying all this stuff in hopes she reads it one day (she doesn't have a reddit account that I know of). Maybe I'm just saying all this but if I did have her back I would just go back to being apathetic again, and cause her pain again. \n\nI just wish I had gone to sleep that one night."}, {"title": "She knows, but not really", "url": "https://www.reddit.com/r/loveconfession/comments/eq703a/she_knows_but_not_really/", "selftext": "I met this girl and I almost instantaneously fell in love. We’ve slept together and spent many hours just in each others arms, but she’s not looking for a relationship. I told her yesterday that she’s the “exception” for me not wanting to get into another relationship. But she has no idea how far I’ve fallen. She has no clue that she’s the reason I want to feel love. She would be terrified if she knew that she single handedly turned a black heart back to red. \n\nShe sleeps around, and normally that would be a turn off, but I just feel different. I feel like I should still stick around and wait because she’s gonna be worth it. She’s the one I want to take in my plane and follow the sunset until we fall out of the sky. And as I gently land the plane in a field, and she steps out and kisses the ground, I want to kneel in front of her, and seal the deal for the rest of our lives."}, {"title": "I'm in love with a girl I snapped almost 2 years ago and can't get her outa my head", "url": "https://www.reddit.com/r/loveconfession/comments/elfj5i/im_in_love_with_a_girl_i_snapped_almost_2_years/", "selftext": "When I met you I thought it was just for fun something I can relieve my stress with fun and sexual intentions. But for some reason I found my self falling for you how we just clicked or at least that's what I felt and still feeling. This was about a year ago and you still pop in my head or dam even it maybe longer then that. I would always try to communicate with you through falls identify. I want you I really do I want them cheesy texts the good morning the goodnight I want it all. I can even say I need it. But now you say you have another man in your life. And it's not my place to get between I just feel sad about it. But I had my chance you where mine at one time and I screwed up. It's also not fair I was with someone at the time but you always where on my mind. That's why I'm writing all this just to get it out of my mind. I don't even know what I will do to get your affection or what I would do when or if we even get together i need to work on my self. I need to get better for you and me. Your image keeps flashing in my head you and your naked body. I can still remember it. I can remember you saying all kinds of things to me. You even said you loved me once. And I felt the same way. Now I will do anything I'm desperate for your attention again. It keeps me up at night. But now again you text me and again I'm using a false identity but I want to let you know who I am how we where before. I'm just afraid if you knew you wouldn't reply just think I'm crazy. For what we had before was just a fling but to me it was more. I love you jenny I do. It's been over a year or 2 and here I am again trying to get back in your life. I don't know whats wrong with me."}, {"title": "Should I ask this man out via email?", "url": "https://www.reddit.com/r/loveconfession/comments/eazto7/should_i_ask_this_man_out_via_email/", "selftext": "There is this man(46/m) I(20/f) like and I thought of writing him an email.\nI would write something like this:\n\n>Hi! I think you're a very handsome man and you're also tall and hairy which I find very attractive. I love your voice too. I would love to get to know you since you seem like a very kind, patient and friendly man and a good person. Maybe we should talk a little here and then get a coffee or something. Even if you don't want to date, we could still be friends.\n\nI am not certain he's single. How do you think he might react? Would he be mh friend if he turns out to not like me or is taken? Also in my language, there is a formal \"pronoun\" to address people which we use in most situations (outside of family and friends) unless otherwise specified and i am not sure if I should use that since it would sound weird in an email like this but I dint want him to get mad at me for this.\n\nTL;DR: I like a stranger and I want to ask him out via email but I am not sure how to do it"}, {"title": "I know her from few centuries..", "url": "https://www.reddit.com/r/loveconfession/comments/eawwa3/i_know_her_from_few_centuries/", "selftext": "Hi everyone. I am new user at reddit. First of all my english is not good. So i m trying my best. \nSo it all started few months ago. That girl started job at  my company and i saw her once just for a second and i was in hurry so something clicked in my mind. So after a week a saw her in our office. So i dont know why all of sudden my mind started to meditate. My mind started repating my personal mantra non stop day and night. It all goes for 1 month. Then in my meditation i saw her with me in past lives. We were together in every life. Then i gather my courage and went to see her at our work. When i reached at her office she was crying. I asked her hi what happen. She said she had nasty interaction with a client. I feel so bad. I console her. I wanted to wipe her tears bjt i cudnt. Then i went back to my office and started crying and pray to god to give me all her worries. Plz dont hurt her. Then my love for her is growing day by day. I cannot think of anything else. Shez all over me. I started cryinv remembering her. She doesnt talk much with me. I have brown skin and shez white. May b she doesnt like brown skin person. I am from diffrent culture. But i love her without any limit. From last 2 monts i am doing medidation 12 hours in 24 hours just for her love. Yesterday at our office we had xmas party and she was dancing with another guy (totally drunk). She was clearly not interested in dancing with him . She was looking uncomfortable. I couldnt do anything. After party she disappeared. I sent her msg on massanger but she didnt reply. I am desperate for her reply. Even i send her frend rqst at fb. But its still pending. I am crying from last night. I really want her in my life. I feel like breatless without her. I wna hear her voice for ages. Wna look into her hazel eyes for ages. I love her heaps. What should i do pleaseee someone help me...."}, {"title": "I need to get this off my chest", "url": "https://www.reddit.com/r/loveconfession/comments/e84qck/i_need_to_get_this_off_my_chest/", "selftext": "I’ve had a crush on this girl for the past year and I’ve asked her out once but she said that she’s not looking for a relationship at that time. But my friends told me that she’s into tall guys and I’m the second tallest in my class. She’s super cute, has a perfect personality, and a beautiful voice. But for me I’m just the quiet shy kid that gets awkward around the girls that he likes.\nAnd she’s the only girl that I’ve ever felt love towards in a long time. The last relationship that I was in was with a girl who used my personality and kindness for granted, forcing me to hangout with her instead of my friends. \n\nAnd it’s been a little hard to trust a girl since her"}, {"title": "I confessed my love to my bestfriend (girl)...", "url": "https://www.reddit.com/r/loveconfession/comments/e1uqbw/i_confessed_my_love_to_my_bestfriend_girl/", "selftext": "I don't know where to start...but she annouced she had gotten a boyfriend hours before the arranged date I chose to tell her, she was clueless of what I was going to say...\n\nAll I know is that it was the first time i've been in love and confessed. I had the worst anxiety attacks that I ever had as well. It started by telling her I wanted to meet up, just us together for a little while.\n\n Then, when the day came, I had trouble thinking straight and just breathing normaly was a pain.\n\n On lunch time, we went outside, just us. But then...Anxiety strikes even harder, I couldn't even say a word without destroying it. So, being conscious I looked like a moron, I just gave up... but luckly I had written what I wanted to tell her on my phone. I then proceeded to say with all my strenght left: he-here, I wrote it down...sorry I am not able to say it...\n\nShe took a long painful time to read it as I just stood in front of her, covered in shame. Suddenly, she lifts her head right deep into my eyes... I could sense a faint feeling of wanting to cry in her. She does not say a single word.\n\nObviously, I am scared... She then opened up her arms, I then went flying into hers. We hugged for a while, then she said: you okay, you're going to survive? The friend zone I mean?\n\n I answered yes of course, knowing I would be friendzoned from the beginning... But I had to let it off my chest.\n\nSo here I am, still friend with her and there's no awkwardness between us, well I still love her and idk if she honnestly does, but she has a boyfriend altough I have the feeling it won't last...\n\nI kinda hope it does last but not at the same time, I don't want her heartbroken again.. Tell me this is normal?\n\nEdit: For christ sake, I take it anymore. I AM BREAKING APART....I am sick and tired of this damn friendzone, it's too damn painful to pretend I am ok. I can't pretend I don't love her, I can't stop thinking about her. I just wish I was the one.."}, {"title": "My two best friends confessed to me what should I do", "url": "https://www.reddit.com/r/loveconfession/comments/e0zinb/my_two_best_friends_confessed_to_me_what_should_i/", "selftext": "I have two best friend who is really different to one another my first best friend had been my best friend since I was a kid he was always been like a brother to me whose really clumsy and tends to get shy even just by talking to other girls while the other one who I had meet in college was more carefree and was more like me. \nHonestly I don't think I like either of them but I don't know how to answer their confession I feel dumb and stupid not to realize anything\nSo can someone tell me what should I do"}, {"title": "Um it’s getting somewhere", "url": "https://www.reddit.com/r/loveconfession/comments/dz6tty/um_its_getting_somewhere/", "selftext": "Yesterday my friend (17m) and me (18f) we’re sitting in my car and like I kinda felt sleepy so I put my head on his shoulder and he started playing with my hair. Later that day around midnight we were texting and he told me I’m his type and asked me if he was mine. I said yes cuz well he is. Now idk what’s gonna happen. Just gonna have to wait and see. Please be free to tell me your opinion."}, {"title": "There was this girl let’s call he issuable that I had feelings for and never said anything because I thought I was not good enough to be her boyfriend, so near the end I got really sick and stayed home and never got to tell her so I fell into a deep depression and it hurt a lot i really regret it.", "url": "https://www.reddit.com/r/loveconfession/comments/dqvnkv/there_was_this_girl_lets_call_he_issuable_that_i/", "selftext": "This was last year in the sixth grade I feel better now but on weekends can’t sleep looking for her name in social media just to not end up depressed again"}, {"title": "To my dear crush", "url": "https://www.reddit.com/r/loveconfession/comments/dd14nr/to_my_dear_crush/", "selftext": "Tbh i love you its damn hard to stop myself to fall for you. I still remember the day when I saw you they way you were smiling uffff i just can't get enough of it. We were in 7th grade now in 11th due to some personal reasons i cant come to school. I miss you. Every day and night. You are the best thing ever happened to me. I am glad that you were my classmate. I know it's hard for you to become mine. Cause i know you don't belive in same gender love. I never thought i would ever fall for you. I am sorry if you ever embarrassed by my stupidity back then like writing your name everywhere i could possibly do I was stupid back i am still a stupid now.... i am sorry if ever you felt hurt because of me really i would never see you hurt cause of me because i love you. I still remember the day when i gave you the gift *necklace written i love you* and me tyrna be snekey as af😂😂😂 which failed cause you caught me i think you threw away the  necklace on that day itself  💔💔 not saying you are a bad person cause i know how you felt that time. I am sorry i just didn't know how to express my love for you. Do you remember the day when you were checking my book and saw your name in heart.... how embarrassed i was ayyshh i still can feel it .... and when you patted my head i couldn't sleep that whole  week cause of it... you know your friend asked me that day itself when you were done patting asking me that do i really love you i really wanted to say YES but all what came was no.... i still remember when you scolded me for me writing your name everywhere. .. i am sorry. ..for being a creep to you.. I am sorry for what i said in fornt of whole class .. i am really sorry .... please forgive me... after that day i started to hate myself for what i did to you even tho i know all i wanted is to love you.. after that i tried so many time to forget you by harming myself in different ways one of the worst was me going in a relationship with opposite gender come to know what that person was cheating on me.... i promise i never wanted you to feel uneasy around me ... after alot of efforts writing letters saying sorry sending flowers and all. I got enough courage to confess you my love for you.... and all you say was K i was really hurt that freaking wrote your name on me with blade  (i know it was stupid but whag could i have done i was depressed. Please don't do what i did ) . Bae please be mine i love you i freaking have dreams of you me together leading a happy  married life. I don't want to be a creep like i was before babe i love you and i will love you till my last breath. There is no one who could take your place in my heart. I am happy that i love you babe. Where ever you are stay strong and happy \n\nBy\n\nYours loving\n\n Stupid person\n\n\n\nIf you ever got this. Smile you look beautiful and breathtaking.\n\nYour birthday is coming soon happy birthday in advance love.\n\nSTAY STRONG REMEMBER ONE THING  I LOVE YOU. I AM PROUD OF YOU.\n\n\n\n*so yeah this is my confession hope you enjoyed it and sorry for grammatic errors*"}, {"title": "Goddammit I shouldn't be liking this person", "url": "https://www.reddit.com/r/loveconfession/comments/d7k02y/goddammit_i_shouldnt_be_liking_this_person/", "selftext": "So a little while ago I started school pretty fun kinda lost my will to live (jk ) and just had nothing in mind \nI really was really bored \nSo one day is class I was bored drew someone from the back \nShe was a girl in my class very beautiful quite long curly hair and by God does she smell amazing \nI thought she was one of those girls that dont have any personality other than being pretty but I was wrong \nShe has very much a personality \nI talked to her a little bit, very nice person \nSo one day i drew her in class because I was bored. and she was just in front of me so I did it \nThe more I looked at her the more my heart started to beat .\nI thought it was because I was staring creepily at someone .\nSo I made the drawing and left it at that .\nSo in a Another lesson I decided I draw another girl she was right in front of me and I showed her she was very happy about and girl 1 asked if I could draw her and my friend goes didn't draw her already .\nSo I share the drawing with her and everyone starts teasing me, it very embarrassing but I didn't take it to hearth \nShe asked me if she could have the drawing and I gave her and she was weirdly happy about it lol \nI try not to draw her now but its very hard because she's always in my mind and it's just not good because she probably has a boyfriend and I just don't wanna get heart broken again \nAnd I just can't stop thinking about her I really hate \nI dont wanna tell her this I just wanna grab my hearth and just stop it \nMaybe I'm just afraid \nIdk I really hate it \nSo now I lay here restless \nTrying to write something to cope with my feelings \n I could go on and on why she's so beautiful and looks like a model \nBut why would someone like her like someone like me \nIdk maybe I just need to stop being a little self loathing bitch and sort out my feelings and try to talk to her and just not be a pussy and just stop over thinking  \nDammit I hate when this happens \nSometimes I just feel like crying"}, {"title": "I have a two and a half years crush", "url": "https://www.reddit.com/r/loveconfession/comments/d3yebx/i_have_a_two_and_a_half_years_crush/", "selftext": "I know this is gonna seem weird but it is true. I have a crush on a girl I see randomly once a day ( passing in the street to her apartment which is at most 15 seconds ) for more than two and a half years now. and the thing is it's pure, I get an enormous amount of joy just by seeing her face. I never look at body not her friends nothing, my heart gets all high once i think that that's her walking 70 meters away. when i see her face in a photo online i involuntarily smile. \nThe question is why i haven't talked to her ( you can see I had time ;) ) I think it's cuz I don't wanna lose that feeling.\n\nwhen we pass each other we make some kind of a polite eye contact but no smile or frown .. nothing.\n\nso what do you think of this relationship or whatever it's called?\n\nedit: I just want advice about what to do cuz I have no idea."}, {"title": "It hurts to want to be with someone...", "url": "https://www.reddit.com/r/loveconfession/comments/czkxsa/it_hurts_to_want_to_be_with_someone/", "selftext": "I’m a 19 year old Texan dude, I go to school in Florida for Computer Animation. Senior year of high school I met this girl, she wasn’t the kind of girl people would look for, but she is the best to me. At the beginning of Senior year, we barely talked, only about homework and how we’re doing in our other classes, nothing more. Later we started talking more and more, we got closer as friends and soon became the best of friends, she told me about her family, I told her about mine. Our pet peeves, our likes, dislikes, everything. It was the closest I’ve been to someone.\n\nI was that edgy teen, I was always tired and was socially awkward, but somehow she got me to open up. I started to express myself through voices, better art, and taking a leadership role in my Tech Theatre class. It was too late when I realized I had a crush on her. Being socially awkward you hide these feelings, and you hide them well. I’ve only had 1 other crush in my life and that was way back in elementary school, which I don’t think actually counted.\n\nChristmas came and there was a secret Santa for the same tech theatre class we were in. Out of pure luck, I was her secret Santa. After shopping for her, I gave her, her presents. She was so happy she hugged me, it was then when these feelings grew. I still hid them.\n\nGraduation was approaching and we were all excited, so me being giddy and complimenting others was just me being happy we were graduating. No one suspected anything. After graduation I went home, went to work the following days, had to leave and pack for Florida. I planned a party for my class and friends so that we can have one last good time together before I leave, and we all go our separate ways. I was planning to tell her there, how I felt. She couldn’t show up.\n\nMy family and I are in Florida and eating at a fast food place, when I tell them I like her, and that I feel terrible not telling her. They tell me to tell her but I couldn’t. I talked to friends and they all said, “Go for it!” And “Tell her!” So I did. She wasn’t interested in a relationship and I accepted and respected her decision. Nothing changed, we still talked and we learned more about each other.\n\nOne year later the feelings came back stronger. They hurt, I knew I can’t and yet I can’t seem to get her out of my head. I tried to talk about it with my friends but it was just, “Dang, that sucks...” I called one of the emotional help lines, they said to try and occupy my mind. Heck, I’ve even tried to look at other women at my school to see if I felt something or anything. But nothing happened. Maybe I’m afraid of losing her. Maybe I faced reality and my mind is subconsciously holding onto those feelings. Maybe I’m just that socially awkward coward who can’t pursue a relationship. Or maybe I fell in love.\n\nIt doesn’t matter, it still hurts and I still can’t bring myself to tell her. It hurts. It honestly does. You can’t eat enough, you can’t sleep enough, you can’t do a lot with that someone occupying your mind. But even though it hurts, it’s somehow a wonderful feeling. I just wish I could tell her without any repercussions, I feel like I only got lucky the first time.\n\nI doubt she is on Reddit. She has no social media apps. But on the off chance she does see this, some how.\n\nI love you."}, {"title": "My confession to my crush", "url": "https://www.reddit.com/r/loveconfession/comments/cy2y8e/my_confession_to_my_crush/", "selftext": "Ok so this actually started not that long ago. Me and one of my old time friends from primary randomly started texting each other (I believe it started when I looked through Instagram and tried searching some names I remembered and there she was). Now In primary school we pretty much had no connection apart from a maths club during school(A time where 4 students where picked and during a Wednesday would go into a room with a teacher and do some extra maths). That was the most time we spent together and still we didn’t really like each other in the way we do now(Well she’s been hinting at something I hope I’m not getting the wrong hints) Anyways we started texting and all that you know the back tracking school memories and stuff. Then out of no where I just feel this hush of happiness coming from her and I feel like we really connect. After a while of talking I start to get anonymous messages on Tellonym(A site where people can send anonymous messages) and I saw that someone liked me. Eventually they started giving me clues as to who they were and I realised it all adds up and that it was now obvious that she indeed liked me now that I think about it this is more about how she confessed her love for me but I’m just going to say it I confessed with a scrambled sentence \nl eoyo tuiiok meaning I like you too \nBut she hasn’t unscrambled it yet so hopefully she likes my response 🤞"}, {"title": "I truly have found my soul mate and it’s unlike anything in the world", "url": "https://www.reddit.com/r/loveconfession/comments/c31rwy/i_truly_have_found_my_soul_mate_and_its_unlike/", "selftext": "I’ve been dating the love of my life for about 10 months now and I would be a liar if I didn’t say how dull my life was before I met her. The same reason we started dating is easily reminded when we are together and even we started dating we figured out very quickly how compatible we were, it was a connection so pure that we almost didn’t even have to say anything we just knew how badly we wanted to be invested in each other’s lives, Friends and family alike always commented on how much we remind each other of each other. We are the same in the best way but even more perfect opposites. What brought me to write this post is because how much she really has been there for me when I’ve needed her the most even when she shouldn’t be, we have fought we have argued but at the end of the day we find our way back to each other no matter what, we literally make fun of why the other was mad (in a healthy way) to realize that what upset the other was just dumb. We know how to grow from mistakes and how set boundaries that will limit our mistakes but what makes our relationship last is that we both are human and can admit our flaws and be completely vulnerable, with out conditions, we truly love and accept each other for those exact reasons.  The simple days are never taken for granted and our most thought out ideas are always commonly appreciated. I’m 25 and have been in a few relationships and to say they pale in comparison would be a vast understatement and quite frankly an insult to how perfect she really is. I can truly say with confidence that I want to spend the rest of my life with this girl. Thank you for being my best friend Brooke! Cheers to the now and many more wonderful memory’s ❤️❤️"}]}